In this project I'll explore the file "Superstore" using different Python libraries, like Pandas and Seaborn. I'll create data visualizations to find patterns and insights in the data.

In [1]:
import pandas as pd

In [6]:
data = pd.read_excel('../data/superstore.xlsm')
data.loc[0:5,['Segment', 'Country','City',]]

     Segment        Country             City
0   Consumer  United States        Henderson
1   Consumer  United States        Henderson
2  Corporate  United States      Los Angeles
3   Consumer  United States  Fort Lauderdale
4   Consumer  United States  Fort Lauderdale
5   Consumer  United States      Los Angeles

In [9]:
data[~(data['Country'] == 'United States')]

Empty DataFrame
Columns: [Row ID, Order ID, Order Date, Ship Date, Ship Mode, Customer ID, Customer Name, Segment, Country, City, State, Postal Code, Region, Product ID, Category, Sub-Category, Product Name, Sales, Quantity, Discount, Profit]
Index: []

[0 rows x 21 columns]

There is no orders outside the United States

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Row ID         9994 non-null   int64
 1   Order ID       9994 non-null   object
 2   Order Date     9994 non-null   datetime64[ns]
 3   Ship Date      9994 non-null   datetime64[ns]
 4   Ship Mode      9994 non-null   object
 5   Customer ID    9994 non-null   object
 6   Customer Name  9994 non-null   object
 7   Segment        9994 non-null   object
 8   Country        9994 non-null   object
 9   City           9994 non-null   object
 10  State          9994 non-null   object
 11  Postal Code    9994 non-null   int64
 12  Region         9994 non-null   object
 13  Product ID     9994 non-null   object
 14  Category       9994 non-null   object
 15  Sub-Category   9994 non-null   object
 16  Product Name   9994 non-null   object
 17  Sales          9994 non-null   float64
 18  Quantity       9994 non-null   int64
 19  Discount       9994 non-null   float64
 20  Profit         9994 non-null   float64
dtypes: datetime64[ns](2), float64(3), int64(3), object(13)
memory usage: 1.6+ MB

In [11]:
data.describe()

,Row ID,Order Date,Ship Date,Postal Code,Sales,Quantity,Discount,Profit
count,9994.000000,9994,9994,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000
mean,4997.500000,2016-04-30 00:07:12.259355648,2016-05-03 23:06:58.571142912,55190.379428,229.858001,3.789574,0.156203,28.656896
min,1.000000,2014-01-03 00:00:00,2014-01-07 00:00:00,1040.000000,0.444000,1.000000,0.000000,-6599.978000
25%,2499.250000,2015-05-23 00:00:00,2015-05-27 00:00:00,23223.000000,17.280000,2.000000,0.000000,1.728750
50%,4997.500000,2016-06-26 00:00:00,2016-06-29 00:00:00,56430.500000,54.490000,3.000000,0.200000,8.666500
75%,7495.750000,2017-05-14 00:00:00,2017-05-18 00:00:00,90008.000000,209.940000,5.000000,0.200000,29.364000
max,9994.000000,2017-12-30 00:00:00,2018-01-05 00:00:00,99301.000000,22638.480000,14.000000,0.800000,8399.976000
std,2885.163629,NaN,NaN,32063.693350,623.245101,2.225110,0.206452,234.260108

In [13]:
data_sample = data.loc[0:5,['Segment', 'Country','City','Sales','Discount','Profit']]
data_sample

     Segment        Country             City     Sales  Discount    Profit
0   Consumer  United States        Henderson  261.9600      0.00   41.9136
1   Consumer  United States        Henderson  731.9400      0.00  219.5820
2  Corporate  United States      Los Angeles   14.6200      0.00    6.8714
3   Consumer  United States  Fort Lauderdale  957.5775      0.45 -383.0310
4   Consumer  United States  Fort Lauderdale   22.3680      0.20    2.5164
5   Consumer  United States      Los Angeles   48.8600      0.00   14.1694

Testing apply function

In [17]:
data_sample['Profit_2'] = data_sample.apply(lambda x: x['Profit'] if x['City'] == 'Henderson' else 0, axis = 1)
data_sample

,Segment,Country,City,Sales,Discount,Profit,Profit_2
0,Consumer,United States,Henderson,261.9600,0.00,41.9136,41.9136
1,Consumer,United States,Henderson,731.9400,0.00,219.5820,219.5820
2,Corporate,United States,Los Angeles,14.6200,0.00,6.8714,0.0000
3,Consumer,United States,Fort Lauderdale,957.5775,0.45,-383.0310,0.0000
4,Consumer,United States,Fort Lauderdale,22.3680,0.20,2.5164,0.0000
5,Consumer,United States,Los Angeles,48.8600,0.00,14.1694,0.0000